Repository: clg55/Scilab-Workbench
Catalog: browsable_source/6.1.0/Linux/scilab-6.1.0/modules/arnoldi/locales/*.po
Languages: de_de

source: %s: Wrong type for argument #%d: A real expected.
de_de: %s: Falscher Typ für Argument #%d: Eine Realzahl erwartet.

source: %s: the computation is already terminated
de_de: %s: die Berechnung ist bereits abgebrochen

source: %s: Wrong size for input argument %s: An array of size %d expected.
de_de: %s: Falsche Größe für Eingangsargument %s: ein Datenfeld der Größe %d erwartet.

source: %s: Wrong size for input argument %s: A matrix of size %dx%d expected.
de_de: %s: Falsche Größe für Eingangsargument %s: eine %dx%d Matrix erwartet.

source: %s: Wrong type for argument #%d: string expected.
de_de: %s: Falscher Typ für Argument #%d: String erwartet.

source: %s: internal error, info=%d.
de_de: %s: Interner Fehler, Info=%d.

source: %s: Can not read input argument #%d.
de_de: %s: Kann Eingabeargument #%d nicht lesen.

source: %s: Wrong value for input argument #%d: k must be in the range 1 to N.
de_de: %s: Falscher Wert für Eingabeargument #%d: k muss im Bereich 1 zu N liegen.

source: %s: Wrong value for input argument #%d: Unrecognized sigma value. Sigma must be one of '%s', '%s', '%s', '%s', '%s' or '%s'.
de_de: %s: Falscher Wert für das Eingangsargument #%d: Nicht erkannter Sigma-Wert. Sigma muss eines von '%s', '%s', '%s', '%s', '%s' oder '%s' sein.

source: %s: Wrong type for input argument #%d: sigma must be a real.
de_de: %s: Falscher Typ für das Eingabeargument #%d: sigma muss eine Realzahl sein

source: %s: B is not positive definite. Try with sigma='SM' or sigma=scalar.
de_de: %s: B ist nicht eindeutig positiv. Versuchen Sie es mit sigma='SM' oder sigma=scalar.

source: %s: If opts.cholB is true, B should be upper triangular.
de_de: %s: Wenn opts.cholB wahr ist, sollte B das obere Dreieck sein.

source: %s: Wrong type for input argument #%d: An integer expected.
de_de: %s: Falscher Typ für das Eingabeargument #%d: Eine ganze Zahl wird erwartet.

source: %s: Wrong value for input argument #%d: For real non symmetric problems, NCV must be k + 2 < NCV <= N.
de_de: %s: Falscher Wert für das Eingangsargument #%d: Für echte unsymmetrische Probleme muss der NCV k + 2 < NCV <= N sein.

source: %s: Error with input argument #%d: B is not positive definite. Try with sigma='SM' or sigma=scalar.
de_de: %s: Fehler beim Eingabeargument #%d: B ist nicht eindeutig positiv. Versuchen Sie es mit sigma='SM' oder sigma=scalar.

source: %s: Error with %s: info = %d
de_de: %s: Fehler mit %s: info = %d

source: %s: Memory allocation error.
de_de: %s: Speicherzuordnungsfehler.

source: %s : Wrong number of input arguments : %d to %d expected.
de_de: %s : Falsche Anzahl von Eingabeargumenten : %d bis %d erwartet.

source: %s: Wrong type for input argument #%d: A full or sparse square matrix or a function expected
de_de: %s: Falscher Typ für das Eingabeargument #%d: Eine vollständige oder grobe quadratische Matrix oder eine Funktion erwartet.

source: %s: Wrong type for input argument #%d: A positive integer expected if the first input argument is a function.
de_de: %s: Falscher Typ für das Eingabeargument #%d: Eine positive ganze Zahl wird erwartet, wenn das erste Eingangsargument eine Funktion ist.

source: %s: Wrong type for input argument #%d: A structure expected
de_de: %s: Falscher Typ für Eingabeargument #%d: Eine Struktur erwartet

source: %s: Wrong type for input argument: If A is a matrix, use opts with tol, maxiter, ncv, resid, cholB
de_de: %s: Falscher Typ für das Eingabeargument: Wenn A eine Matrix ist, wähen Sie tol, maxiter, ncv, resid, cholB, ncv.

source: %s: Wrong type for input argument: If A is a function, use opts with tol, maxiter, ncv, resid, cholB, issym
de_de: %s: Falscher Typ für das Eingabeargument: Wenn A eine Funktion ist, wählen Sie tol, maxiter, ncv, resid, cholB, issym.

source: %s: Wrong type for input argument #%d: string expected.
de_de: %s: Falscher Typ für das Eingabeargument #%d: Zeichenkette erwartet.

source: %s: Wrong value for input argument #%d: Unrecognized sigma value. Sigma must be one of '%s', '%s', '%s', '%s', '%s' or '%s'.
de_de: %s: Falscher Wert für das Eingangsargument #%d: Nicht erkannter Sigma-Wert. Sigma muss einer von '%s', '%s', '%s', '%s', '%s' oder '%s' sein.

source: %s: Wrong type for input argument #%d: a real scalar or a string expected.
de_de: %s: Falscher Typ für das Eingabeargument #%d: ein echter Skalar oder eine Zeichenkette erwartet.

source: %s: Wrong dimension for input argument #%d: %s must be 1 by 1 size.
de_de: %s: Falsche Dimension für das Eingabeargument #%d: %s muss Größe 1 zu 1 haben.

source: %s: Wrong value for input argument #%d: For real non symmetric problems, NCV must be k + 2 < NCV < N.
de_de: %s: Falscher Wert für das Eingangsargument #%d: Für echte unsymmetrische Probleme muss der NCV k + 2 < NCV < N sein.

source: %s: Wrong type for input argument #%d: Start vector %s must be complex for complex problems.
de_de: %s: Falscher Typ für das Eingabeargument #%d: Der Startvektor %s muss bei komplexen Problemen komplex sein.

source: %s: Wrong type for input argument #%d: if opts.cholB is true, B must be upper triangular.
de_de: %s: Falscher Typ für das Eingabeargument #%d: Wenn opts.cholB wahr ist, muss B das obere Dreieck sein.

source: %s: Impossible to use the Cholesky factorization with complex sparse matrices.
de_de: %s: Unmöglich, die Cholesky-Faktorisierung mit komplexen dünnen Matrizen zu verwenden.

source: %s: Error with %s: info = %d.
de_de: %s: Fehler bei %s: info = %d.

source: %s: Wrong type for input argument #%d: n must be a positive integer.
de_de: %s: Falscher Typ für das Eingabeargument #%d: n muss eine positive ganze Zahl sein.

source: %s: Wrong value for input argument #%d: For real symmetric problems, k must be in the range 1 to N - 1.
de_de: %s: Falscher Wert für das Eingangsargument #%d: Für echte symmetrische Probleme muss k im Bereich von 1 bis N - 1 liegen.

source: %s: Wrong value for input argument #%d: For real non symmetric or complex problems, k must be in the range 1 to N - 2.
de_de: %s: Falscher Wert für das Eingangsargument #%d: Für echte unsymmetrische oder komplexe Probleme muss k im Bereich von 1 bis N - 2 liegen.

source: %s: Wrong type for input argument #%d: a scalar expected.
de_de: %s: Falscher Typ für das Eingabeargument #%d: ein Skalar erwartet.

source: %s: Wrong type for input argument #%d: a string expected.
de_de: %s: Falscher Typ für das Eingabeargument #%d: eine Zeichenkette erwartet.

source: %s: Wrong value for input argument #%d: Unrecognized sigma value. Sigma must be one of %s, %s, %s, %s or %s.
de_de: %s: Falscher Wert für das Eingangsargument #%d: Nicht erkannter Sigma-Wert. Sigma muss eines von %s, %s, %s, %s oder %s sein.

source: %s: Wrong value for input argument #%d: Unrecognized sigma value. Sigma must be one of %s, %s, %s, %s, %s or %s.
de_de: %s: Falscher Wert für das Eingangsargument #%d: Nicht erkannter Sigma-Wert. Sigma muss eines von %s, %s, %s, %s, %s oder %s sein.

source: %s: Wrong dimension for input argument #%d: %s must be an integer scalar.
de_de: %s: Falsche Dimension für das Eingabeargument #%d: %s muss eine ganze Zahl sein, die skalar ist.

source: %s: Wrong dimension for input argument #%d: Start vector opts.resid must be N by 1.
de_de: %s: Falsche Dimension für das Eingabeargument #%d: Der Startvektor opts.resid muss N x 1 sein.

source: %s: Wrong type for input argument #%d: Start vector opts.resid must be real for real problems.
de_de: %s: Falscher Typ für das Eingabeargument #%d: Startvektor opts.resid muss real sein, um real-Probleme zu lösen.

source: %s: Wrong type for input argument #%d: Start vector opts.resid must be complex for complex problems.
de_de: %s: Falscher Typ für das Eingabeargument #%d: Startvektor opts.resid muss komplex sein, um komplex-Probleme zu lösen.

source: %s: Wrong value for input argument #%d: n does not match rows number of matrix A.
de_de: %s: Falscher Wert für das Eingabeargument #%d: n stimmt nicht mit der Zeilennummer der Matrix A überein.

source: %s: Wrong type or value for input arguments.
de_de: %s: Falscher Typ oder Wert für Eingabeargumente.
