Repository: clg55/Scilab-Workbench
Catalog: browsable_source/5.2.2/macOS/scilab-5.2.2/modules/metanet/locales/*/metanet.po
Languages: es_es, zh_cn

source: &File
es_es: Archivo
zh_cn: 文件(&F)

source: &Tools
es_es: Herramien&tas
zh_cn: 工具(&T)

source: &Edit
es_es: &Editar
zh_cn: 编辑(&E)

source: %s: First argument must be a vector of size greater or equal to 2.
es_es: %s: El primer argumento debe ser un vector mayor o igual a 2.
zh_cn: %s：第一个参数必须为长度大于或等于2的向量。

source: %s: Second argument must be a vector with same dimension as the first one.
es_es: %s: El segundo argumento debe ser un vector de la misma dimensión que el primero.
zh_cn: %s：第二个参数必须为跟第一个参数同样维数的向量。

source: %s: Third argument must be a vector of size greater or equal to 1.
es_es: %s: El tercer argumento debe ser un vector mayor o igual a 1.
zh_cn: %s：第三个参数必须为元素数大于等于1的向量。

source: %s: First argument must be a vector with positive integer values.
es_es: %s: El primer argumento debe ser un vector con valores enteros positivos.
zh_cn: %s：第一个参数必须为元素都是正整数的向量。

source: %s: Second argument must be a vector with positive integer values.
es_es: %s: El segundo argumento debe ser un vector con valores enteros positivos.
zh_cn: %s：第二个参数必须为元素都是正整数的向量。

source: %s: Third argument must be a vector with positive integer values.
es_es: %s: El tercer argumento debe ser un vector con valores enteros positivos.
zh_cn: %s：第三个参数必须为元素都是正整数的向量。

source: Running out of memory
es_es: Poca memoria
zh_cn: 内存不足

source: "%s" is a directory
es_es: %s es un directorio
zh_cn: "%s" 是目录

source: Directory "%s" does not exist
es_es: El directorio "%s" no existe
zh_cn: 目录"%s"不存在

source: Graph file "%s/%s.graph" does not exist
es_es: El archivo de grafo "%s/%s.graph" no existe
zh_cn: 图形文件"%s/%s.graph"不存在

source: Unable to open file "%s/%s.graph"
es_es: Imposible abrir el archivo "%s/%s.graph"
zh_cn: 无法打开文件"%s/%s.graph"

source: Bad graph file. Node "%s" is duplicated
es_es: Archivo de grafo incorrecto. El nodo "%s" está duplicado

source: Bad graph file. Node "%s" referenced by arc "%s" not found
es_es: Archivo de grafo incorrecto. El nodo "%s" al que hace referencia arc "%s" no encontrado

source: Scilab module metanet not installed.
es_es: El módulo metanet de Scilab no instalado.
zh_cn: Scilab模块metanet没有安装。

source: Bad internal node number %d
es_es: Nodo interno número %d incorrecto
zh_cn: 错误的内部节点号%d

source: Bad internal arc number %d
es_es: Arc interno número %d incorrecto
zh_cn: 错误的内部arc number %d

source: Unable to write file in directory %s, check access
es_es: Incapaz de escribir archivo en el directorio %s, revise el acceso
zh_cn: 无法再目录%s中对文件进行写操作，请检查权限
