Repository: clg55/Scilab-Workbench
Catalog: browsable_source/5.0.2/Linux-Windows/scilab-5.0.2/scilab/modules/development_tools/locales/*/development_tools.po
Languages: fr_fr

source: scitest: first input argument should not be a file with .dia suffix
fr_fr: scitest: Le premier argument d'entrée ne devrait pas être un fichier avec l'extension .dia

source: Test failed ERROR DETECTED while executing %s
fr_fr: Test échoué. Erreur detectée en exécutant %s

source: Test Failed. See : fc /L /N %s
fr_fr: Test échoué. Voir : fc /L /N %s

source: Test Failed. See : diff -wu %s
fr_fr: Test échoué. Voir : diff -wu %s

source: Test passed
fr_fr: Test réussi

source: No variable %s_ref in reference file
fr_fr: Pas de variable %s_ref dans le fichier de référence

source: %s is not an installed module
fr_fr: %s n'est pas un module installé

source: error : Input argument sizes are not valid
fr_fr: Erreur: Taille des arguments d'entrées incorrecte

source: The test %s is not available from the %s module
fr_fr: Le test %s n'est pas disponible pour le module %s

source: The ref file (%s) doesn''t exist
fr_fr: Le fichier de référence (%s) n'existe pas
